emacs.org
#+title: Annenpolka's Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+STARTUP: fold indent

My configuration managed by leaf.el + straight.el

* Greeeting Documentation
#+begin_src emacs-lisp

  ;;; init.el --- My init.el  -*- lexical-binding: t; -*-

  ;; Author: annenpolka <lancelbb@gmail.com>

  ;; This program is free software: you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

  ;;; Commentary:

  ;; My init.el.

  ;;; Code:
  
#+end_src
* early-init.el Configuration
** Sane Dafaults
#+begin_src emacs-lisp :tangle ./early-init.el
  ;;; early-init --- Early initialization file  -*- lexical-binding: t; -*-

  ;;; Code:

  (setq
   gc-cons-threshold most-positive-fixnum
   gc-cons-percentage 0.5)


  (set-language-environment 'Japanese)
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (setq use-dialog-box nil)

  (setq frame-resize-pixelwise t)
  (setq frame-inhibit-implied-resize t)
  (setq inhibit-splash-screen t)

  ;; disable bars
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)

  ;;   (setq user-emacs-directory (file-name-directory load-file-name)))

  (setq package-enable-at-startup nil)
  (setq native-comp-async-report-warnings-errors nil)
  ;; suppress cl deprecation warnings
  (setq byte-compile-warnings '(not cl-functions obsolete))
  ;; suppress ad-redefinition warnings
  (setq ad-redefinition-action 'accept)

  ;; disable straight-process-buffer
  (defvar straight-process-buffer)
  (setq-default straight-process-buffer " *straight-process*")
#+end_src

** Startup Profiler
*** startup scripts
#+begin_src emacs-lisp :tangle ./early-init.el
  (defvar setup-tracker--level 0)
  (defvar setup-tracker--parents nil)
  (defvar setup-tracker--times nil)

  (when load-file-name
    (push load-file-name setup-tracker--parents)
    (push (current-time) setup-tracker--times)
    (setq setup-tracker--level (1+ setup-tracker--level)))

  (add-variable-watcher
   'load-file-name
   (lambda (_ v &rest __)
     (cond ((equal v (car setup-tracker--parents))
            nil)
           ((equal v (cadr setup-tracker--parents))
            (setq setup-tracker--level (1- setup-tracker--level))
            (let* ((now (current-time))
                   (start (pop setup-tracker--times))
                   (elapsed (+ (* (- (nth 1 now) (nth 1 start)) 1000)
                               (/ (- (nth 2 now) (nth 2 start)) 1000))))
              (with-current-buffer (get-buffer-create "*setup-tracker*")
                (save-excursion
                  (goto-char (point-min))
                  (dotimes (_ setup-tracker--level) (insert "> "))
                  (insert
                   (file-name-nondirectory (pop setup-tracker--parents))
                   " (" (number-to-string elapsed) " msec)\n")))))
           (t
            (push v setup-tracker--parents)
            (push (current-time) setup-tracker--times)
            (setq setup-tracker--level (1+ setup-tracker--level))))))
#+end_src
** Optimizations/Utility Constants
だいたいdoomからの借り物
#+begin_src emacs-lisp :tangle ./early-init.el
  ;; Operating system
  (defconst IS-MAC      (eq system-type 'darwin))
  (defconst IS-LINUX    (eq system-type 'gnu/linux))
  (defconst IS-WINDOWS  (memq system-type '(cygwin windows-nt ms-dos)))
  (defconst IS-BSD      (or IS-MAC (eq system-type 'berkeley-unix)))

  ;; GUIs are inconsistent across systems, will rarely match our active Emacs
  ;; theme, and impose their shortcut key paradigms suddenly. Let's just avoid
  ;; them altogether and have Emacs handle the prompting.
  (setq use-dialog-box nil)
  (when (bound-and-true-p tooltip-mode)
    (tooltip-mode -1))
  (when IS-LINUX
    (setq x-gtk-use-system-tooltips nil))

  ;; Prioritize old byte-compiled source files over newer sources. It saves us a
  ;; little IO time to skip all the mtime checks on each lookup.
  (setq load-prefer-newer nil)

  (let ((old-file-name-handler-alist file-name-handler-alist))
    ;; `file-name-handler-alist' is consulted on each `require', `load' and
    ;; various path/io functions. You get a minor speed up by unsetting this.
    ;; Some warning, however: this could cause problems on builds of Emacs where
    ;; its site lisp files aren't byte-compiled and we're forced to load the
    ;; *.el.gz files (e.g. on Alpine).
    (setq-default file-name-handler-alist nil)
    ;; ...but restore `file-name-handler-alist' later, because it is needed for
    ;; handling encrypted or compressed files, among other things.
    (defun doom-reset-file-handler-alist-h ()
      (setq file-name-handler-alist
            ;; Merge instead of overwrite because there may have bene changes to
            ;; `file-name-handler-alist' since startup we want to preserve.
            (delete-dups (append file-name-handler-alist
                                 old-file-name-handler-alist))))
    (add-hook 'emacs-startup-hook #'doom-reset-file-handler-alist-h 101))

  ;; Premature redisplays can substantially affect startup times and produce
  ;; ugly flashes of unstyled Emacs.
  (setq-default inhibit-redisplay t
                inhibit-message t)
  (add-hook 'window-setup-hook
            (lambda ()
              (setq-default inhibit-redisplay nil
                            inhibit-message nil)
              (redisplay)))

  ;; Shave seconds off startup time by starting the scratch buffer in
  ;; `fundamental-mode', rather than, say, `org-mode' or `text-mode', which pull
  ;; in a ton of packages. `doom/open-scratch-buffer' provides a better scratch
  ;; buffer anyway.
  ;; (setq initial-major-mode 'fundamental-mode
  ;;       initial-scratch-message nil)

  ;; Remove command line options that aren't relevant to our current OS; means
  ;; slightly less to process at startup.
  (unless IS-MAC    (setq command-line-ns-option-alist nil))
  (unless IS-LINUX  (setq command-line-x-option-alist nil))

  ;; A second, case-insensitive pass over `auto-mode-alist' is time wasted and
  ;; indicates misconfiguration.
  (setq auto-mode-case-fold nil)

  ;; Disable bidirectional text scanning for a modest performance boost. I've set
  ;; this to `nil' in the past, but the `bidi-display-reordering's docs say that
  ;; is an undefined state and suggest this to be just as good:
  (setq-default bidi-display-reordering 'left-to-right
                bidi-paragraph-direction 'left-to-right)

  ;; Disabling the BPA makes redisplay faster, but might produce incorrect display
  ;; reordering of bidirectional text with embedded parentheses and other bracket
  ;; characters whose 'paired-bracket' Unicode property is non-nil.
  (setq bidi-inhibit-bpa t)  ; Emacs 27 only

  ;; Reduce rendering/line scan work for Emacs by not rendering cursors or regions
  ;; in non-focused windows.
  (setq-default cursor-in-non-selected-windows nil)
  (setq highlight-nonselected-windows nil)

  ;; More performant rapid scrolling over unfontified regions. May cause brief
  ;; spells of inaccurate syntax highlighting right after scrolling, which should
  ;; quickly self-correct.
  (setq fast-but-imprecise-scrolling t)

  ;; Increase how much is read from processes in a single chunk (default is 4kb).
  ;; This is further increased elsewhere, where needed (like our LSP module).
  (setq read-process-output-max (* 64 1024))  ; 64kb

  ;; Emacs "updates" its ui more often than it needs to, so slow it down slightly
  (setq idle-update-delay 1.0)  ; default is 0.5

  ;; Font compacting can be terribly expensive, especially for rendering icon
  ;; fonts on Windows. Whether disabling it has a notable affect on Linux and Mac
  ;; hasn't been determined, but do it anyway, just in case. This increases memory
  ;; usage, however!
  (setq inhibit-compacting-font-caches t)

  ;;; early-init.el ends here
#+end_src
* Package Manager Setup
package-archivesのURL設定と、straight.elとleaf.elのインストールを行う。
** bootstrap (with straight, leaf-keywords)
#+begin_src emacs-lisp
  (setq straight-repository-branch "develop"
        ;; don't check on find-at-startup
        straight-check-for-modifications '(check-on-save find-when-checking)
        ;; shallow clone repos
        straight-vc-git-default-clone-depth 1)

  ;; setup straight.el
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
  ;; install leaf requirements by straight
  (straight-use-package 'leaf) (straight-use-package 'leaf-keywords)

  (leaf leaf-keywords
    :init
    ;; optional packages if you want to use :hydra, :el-get, :blackout,,,
    (straight-use-package 'hydra)
    (straight-use-package 'major-mode-hydra)
    (straight-use-package 'blackout)
    (straight-use-package 'system-packages)
    ;; use bind-key for modal-depending keymapping
    (straight-use-package 'bind-key)
    :config
    ;; initialize leaf-keywords.el
    (leaf-keywords-init))
#+end_src
** leaf
#+begin_src emacs-lisp
  ;; leaf plugins
  (leaf leaf
    :config
    (leaf leaf-convert :straight t))
    
#+end_src
* Emacs Basic/QOL Configuration
** cus-start (Emacs本体の基本設定)
#+begin_src emacs-lisp

  ;; set builtin configs via leaf
  (leaf
    cus-start
    :doc "define customization properties of builtins"
    :tag
    "builtin"
    "internal"
    :preface
    (defun c/redraw-frame nil
      (interactive)
      (redraw-frame))
    :bind (("M-ESC ESC" . c/redraw-frame))
    :custom
    '
    ((user-full-name . "annenpolka")
     (user-mail-address . "lancelbb@gmail.com")
     (user-login-name . "annenpolka")
     (backup-directory-alist . '((".*" . "~/.backup")))
     (create-lockfiles . nil)
     (debug-on-error . nil)
     (init-file-debug . nil)
     (frame-resize-pixelwise . t)
     (enable-recursive-minibuffers . t)
     (history-length . 1000)
     (history-delete-duplicates . t)
     (scroll-preserve-screen-position . t)
     (scroll-conservatively . 100)
     (mouse-wheel-scroll-amount . '(1 ((control) . 5)))
     (ring-bell-function . 'ignore)
     (text-quoting-style . 'straight)
     (truncate-lines . t)
     (completion-cycle-threshold . 3)
     (tab-always-indent . 'complete)
     (scroll-bar-mode . nil)
     (indent-tabs-mode . nil)
     (vc-follow-symlinks . t)
     (select-enable-primary . nil)
     (show-paren-style . 'parenthesis)
     (bookmark-watch-bookmark-file . 'silent))
    :init
    (defalias 'yes-or-no-p 'y-or-n-p)
    (define-key key-translation-map [?\C-h] [?\C-?])
    (global-set-key (kbd "C-?") 'help-for-help)
    (define-key input-decode-map [?\C-i] [C-i]))
    
#+end_src
** cus-edit (custom.elの二重管理抑止)
#+begin_src emacs-lisp
  
  (leaf
    cus-edit
    :doc "tools for customizing Emacs and Lisp packages"
    :tag
    "builtin"
    "faces"
    "help"
    :custom `((custom-file . ,(locate-user-emacs-file "custom.el"))))

#+end_src
  
