emacs.org
** persistent-scratch (scratchバッファの永続化)
#+begin_src emacs-lisp
  (leaf
    persistent-scratch
    :doc "keep scratch buffer state across sessions"
    :straight t
    :defun (persistent-scratch-setup-default)
    :config (persistent-scratch-setup-default))
#+end_src

** COMMENT Automatic Tangling (orgファイル→init.elへの書き出し)

DEPRECATED: org-auto-tangleに移行した

#+begin_src emacs-lisp  
  ;; Tangle the code blocks on save.
  (defun my/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "emacs.org" user-emacs-directory))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'my/org-babel-tangle-config)))
#+end_src

** Garbage Collection
*** gcmh

gcmhはユーザー操作していない間にGCを行うことで、STWの影響を最小限に留めるアプローチを採っている。

#+begin_src emacs-lisp
  (leaf gcmh
    :straight t
    :blackout t
    :defun (gcmh-mode)
    :hook (windows-startup-hook . gcmh-mode)
    :custom
    (gcmh-verbose . t)
    :config
    (setq gcmh-idle-delay 'auto  ; default is 15s
          gcmh-auto-idle-delay-factor 10
          gcmh-high-cons-threshold (* 16 1024 1024)))  ; 16mb
    
#+end_src

** No littering
#+begin_src emacs-lisp
  (leaf no-littering
    :straight t
    :require t
    :init
    (setq no-littering-etc-directory
          (expand-file-name "config/" user-emacs-directory))
    (setq no-littering-var-directory
          (expand-file-name "data/" user-emacs-directory))
    (setq auto-save-file-name-transforms
          `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))))
#+end_src
** helpful-mode
#+begin_src emacs-lisp
  ;; enhanced help
(leaf helpful
  :straight t
  :bind
  ("C-h f" . helpful-callable)
  ("C-h k" . helpful-key)
  ("C-h v" . helpful-variable))
#+end_src

** Emacs Debugging
*** macrostep (Expanding Elisp Macro)

Emacs Lispのマクロを展開し、式を確認してデバッグできる。

#+begin_src emacs-lisp
  ;; explain macro by step
  (leaf
    macrostep
    :straight t
    :require t
    :bind (("C-c e" . macrostep-expand)))
#+end_src
*** restart-emacs
#+begin_src emacs-lisp
  (leaf restart-emacs
    :straight t
    :commands (restart-emacs restart-emacs-start-new-emacs))
#+end_src

** exec-path-from-shell
#+begin_src emacs-lisp
  (leaf exec-path-from-shell
    :straight t
    :config
    ;; setup on mac/linux
    (when (or IS-MAC IS-LINUX)
      ;; (memq window-system '(mac ns x))
      (exec-path-from-shell-initialize)
      ;; add mason's executable to emacs's exec-path
      (let ((mason-path (expand-file-name "~/.local/share/nvim/mason/bin/")))
        (setq exec-path (add-to-list 'exec-path mason-path)))))
      
    
#+end_src

** WSL-specific Setup
#+begin_src emacs-lisp
  ;; WSL-specific setup
  (defconst IS-WSL (and (eq system-type 'gnu/linux) (getenv "WSLENV")))
  (when IS-WSL
    ;; Teach Emacs how to open links in your default Windows browser
    (let ((cmd-exe "/mnt/c/Windows/System32/cmd.exe")
          (cmd-args '("/c" "start")))
      (when (file-exists-p cmd-exe)
        (setq browse-url-generic-program  cmd-exe
              browse-url-generic-args     cmd-args
              browse-url-browser-function 'browse-url-generic
              search-web-default-browser 'browse-url-generic))))
#+end_src
* Kurumi Configs
** kurumi-utility-map
#+begin_src emacs-lisp
  ;; my utility keymap
  (leaf kurumi-utility
    :init
    (defvar kurumi-utility-map)
    (setq kurumi-utility-map (make-sparse-keymap))
    :config
    (bind-keys :map kurumi-utility-map
               ("g d" . xref-find-definitions)
               ("g r" . xref-find-references)
               ("c a" . lsp-execute-code-action)
               ("r n" . lsp-rename)
               ("q" . flycheck-list-errors)
               ("d o" . devdocs-browser-open)
               ("d i" . devdocs-install-doc)))
#+end_src
* Input Method
** mozc
#+begin_src emacs-lisp
  ;; mozc ime
  (leaf
    mozc
    ;; :depends emacs-mozc
    :straight t
    :bind* (("<zenkaku-hankaku>" . toggle-input-method)
            ("<eisu-toggle>" . toggle-input-method))
    :custom
    ((default-input-method . "japanese-mozc")
     (mozc-candidate-style . 'overlay))
    :init
    (defun off-input-method nil
      "deactivate multilingual input method."
      (interactive)
      (deactivate-input-method))
    (defun on-input-method nil
      "activate multilingual input method."
      (interactive)
      (activate-input-method default-input-method)))
    
#+end_src
* Fonts/Icons
** Font Config
日本語てすとあいうえお、。

#+begin_src emacs-lisp
  (set-face-attribute 'default nil :font "Iosevka Term-14")
  (set-face-attribute 'fixed-pitch nil :family "Iosevka Term" :height 1.0)
  (set-face-attribute 'variable-pitch nil :family "MigMix 1M" :height 1.0)

  ;; Japanese font
  (set-fontset-font t 'japanese-jisx0208 (font-spec :family "Migmix 1M"))
#+end_src
** all-the-icons
#+begin_src emacs-lisp
  ;; icons dependency
  (leaf all-the-icons
    :straight t
    :custom
    (all-the-icons-scale-factor . 1.1))
    
#+end_src
** kind-icon
#+begin_src emacs-lisp
  (leaf
    kind-icon
    :straight t
    :after corfu
    :custom
    (kind-icon-default-face 'corfu-default) ; to compute blended backgrounds correctly
    :config
    (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
#+end_src
** emojify
#+begin_src emacs-lisp
  (leaf emojify
    :straight t
    :hook (after-init-hook . global-emojify-mode))
#+end_src
* Themes
** COMMENT Modus Themes
#+begin_src emacs-lisp
  ;; modus theme
  (leaf modus-themes
    :custom
    (modus-themes-completions . 'subtle)
    (modus-themes-fringes . 'subtle)
    (modus-themes-italic-constructs . t)
    (modus-themes-bold-constructs . nil)
    (modus-themes-tabs-accented . nil)
    (modus-themes-mode-line . '(borderless))
    (modus-themes-hl-line . '(intense underline))
    (modus-themes-region . '(bg-only no-extend))
    (modus-themes-scale-headings . t)
    (modus-themes-prompts . '(background bold gray intense italic))
    (modus-themes-syntax . '(faint alt-syntax green-strings))
    :config (load-theme 'modus-vivendi))
#+end_src
** doom-themes
#+begin_src emacs-lisp
  (leaf doom-themes
    :straight t
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-molokai t)

    ;; Enable flashing mode-line on errors
    ;; (doom-themes-visual-bell-config)
    ;; ;; Enable custom neotree theme (all-the-icons must be installed!)
    ;; (doom-themes-neotree-config)
    ;; ;; or for treemacs users
    ;; (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
    ;; (doom-themes-treemacs-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))
#+end_src
* Startup Menu
** dashboard
#+begin_src emacs-lisp
  (leaf dashboard
    :straight t
    :hook (after-init-hook . dashboard-setup-startup-hook)
    :custom
    (dashboard-banner-logo-title . "Kurumi Emacs")
    (dashboard-startup-banner . 'logo)
    (dashboard-footer-messages .
                               '("I'm a thinker, I could break it down."
                                 "I'm a shooter. A drastic baby."
                                 "Agitate and jump out. Feel it in the will."
                                 "Can you talk about deep-sea with me."
                                 "The deep-sea fish loves you forever. All are as your thinking over."
                                 "Out of space, when someone waits there."
                                 "Sound of jet, they played for out."))
    (dashboard-projects . 'projectile)
    (dashboard-items . '((recents  . 5)
                         (bookmarks . 10)
                         (projects . 5)))
    :defer-config
    (setq dashboard-footer-icon (all-the-icons-material "dashboard"
                                                        :height 1.0
                                                        :v-adjust -0.05
                                                        :face 'font-lock-keyword-face)))
    
#+end_src
* Modeline
** doom-modeline
#+begin_src emacs-lisp
  (leaf doom-modeline
    :straight t
    :hook
    (window-setup-hook . doom-modeline-mode)
    :custom
    (doom-modeline-minor-modes . nil)
    (doom-modeline-major-mode-icon . t)
    (doom-modeline-bar-width . 6)
    (doom-modeline-height . 15)
    (doom-modeline-modal-icon . nil)
    (doom-modeline-icon . t)
    :defer-config
    (custom-set-faces
     '(mode-line ((t (:family "Hack" :height 0.9))))
     ;; '(mode-line-active ((t (:family "Hack" :height 0.9 :weight light))))
     '(mode-line-inactive ((t (:family "Hack" :height 0.9)))))

    ;; Define your custom doom-modeline
    (doom-modeline-def-modeline 'main
      '(bar matches buffer-info remote-host buffer-position parrot selection-info lsp checker)
      '(misc-info minor-modes input-method buffer-encoding major-mode process vcs " ")) ; <-- added padding here
    (doom-modeline-def-modeline 'org-src
      '(bar matches buffer-info-simple buffer-position parrot selection-info checker)
      '(misc-info minor-modes lsp input-method buffer-encoding major-mode process vcs " "))) ; <-- added padding here
    
#+end_src
** COMMENT moody
#+begin_src emacs-lisp
  (leaf moody
    :straight t
    :require t
    :custom
    (x-underline-at-descent-line . t)
    (moody-mode-line-height . 25)
    :config
    (custom-set-faces
     '(mode-line ((t (:family "Hack" :height 0.9))))
     '(mode-line-active ((t (:family "Hack" :height 0.9)))) ; For 29+
     '(mode-line-inactive ((t (:family "Hack" :height 0.9)))))
    (moody-replace-mode-line-buffer-identification)
    (moody-replace-vc-mode)
    (moody-replace-eldoc-minibuffer-message-function))
#+end_src
** COMMENT minions
#+begin_src emacs-lisp
  (leaf minions
    :straight t
    :require t
    :global-minor-mode minions-mode)
#+end_src
* Tabline
