init.el
  persistent-scratch
  :doc "keep scratch buffer state across sessions"
  :straight t
  :defun (persistent-scratch-setup-default)
  :config (persistent-scratch-setup-default))

(leaf gcmh
  :straight t
  :blackout t
  :defun (gcmh-mode)
  :hook (windows-startup-hook . gcmh-mode)
  :custom
  (gcmh-verbose . t)
  :config
  (setq gcmh-idle-delay 'auto  ; default is 15s
        gcmh-auto-idle-delay-factor 10
        gcmh-high-cons-threshold (* 16 1024 1024))  ; 16mb
  )

;; explain macro by step
(leaf
  macrostep
  :straight t
  :require t
  :bind (("C-c e" . macrostep-expand)))

(leaf restart-emacs
  :straight t
  :commands (restart-emacs restart-emacs-start-new-emacs))

(leaf exec-path-from-shell
  :straight t
  :config
  ;; setup on mac/linux
  (when (or IS-MAC IS-LINUX)
    ;; (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)
    ;; add mason's executable to emacs's exec-path
    (let ((mason-path (expand-file-name "~/.local/share/nvim/mason/bin/")))
      (setq exec-path (add-to-list 'exec-path mason-path)))
    )
  )

;; WSL-specific setup
(when (and (eq system-type 'gnu/linux)
           (getenv "WSLENV"))

  ;; Teach Emacs how to open links in your default Windows browser
  (let ((cmd-exe "/mnt/c/Windows/System32/cmd.exe")
        (cmd-args '("/c" "start")))
    (when (file-exists-p cmd-exe)
      (setq browse-url-generic-program  cmd-exe
            browse-url-generic-args     cmd-args
            browse-url-browser-function 'browse-url-generic
            search-web-default-browser 'browse-url-generic))))

;; mozc ime
(leaf
  mozc
  ;; :depends emacs-mozc
  :straight t
  :bind* (("<zenkaku-hankaku>" . toggle-input-method)
          ("<eisu-toggle>" . toggle-input-method))
  :custom
  ((default-input-method . "japanese-mozc")
   (mozc-candidate-style . 'overlay))
  :init
  (defun off-input-method nil
    "deactivate multilingual input method."
    (interactive)
    (deactivate-input-method))
  (defun on-input-method nil
    "activate multilingual input method."
    (interactive)
    (activate-input-method default-input-method))
  )

(set-face-attribute 'default nil :font "Iosevka Term-14")
(set-face-attribute 'fixed-pitch nil :family "Iosevka Term" :height 1.0)
(set-face-attribute 'variable-pitch nil :family "MigMix 1M" :height 1.0)

;; Japanese font
(set-fontset-font t 'japanese-jisx0208 (font-spec :family "Migmix 1M"))

;; icons dependency
(leaf all-the-icons
  :straight t
  :custom
  (all-the-icons-scale-factor . 1.1)
  )

(leaf
  kind-icon
  :straight t
  :after corfu
  :custom
  (kind-icon-default-face 'corfu-default) ; to compute blended backgrounds correctly
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

(leaf emojify
  :straight t
  :hook (after-init-hook . global-emojify-mode))

(leaf doom-themes
  :straight t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-molokai t)

  ;; Enable flashing mode-line on errors
  ;; (doom-themes-visual-bell-config)
  ;; ;; Enable custom neotree theme (all-the-icons must be installed!)
  ;; (doom-themes-neotree-config)
  ;; ;; or for treemacs users
  ;; (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
  ;; (doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(leaf dashboard
  :straight t
  :hook (after-init-hook . dashboard-setup-startup-hook)
  :custom
  (dashboard-banner-logo-title . "Kurumi Emacs")
  (dashboard-startup-banner . 'logo)
  (dashboard-footer-messages .
                             '("I'm a thinker, I could break it down."
                               "I'm a shooter. A drastic baby."
                               "Agitate and jump out. Feel it in the will."
                               "Can you talk about deep-sea with me."
                               "The deep-sea fish loves you forever. All are as your thinking over."
                               "Out of space, when someone waits there."
                               "Sound of jet, they played for out."))
  (dashboard-projects . 'projectile)
  (dashboard-items . '((recents  . 5)
                       (bookmarks . 10)
                       (projects . 5)))
  :defer-config
  (setq dashboard-footer-icon (all-the-icons-material "dashboard"
                                                      :height 1.0
                                                      :v-adjust -0.05
                                                      :face 'font-lock-keyword-face))
  )

(leaf doom-modeline
  :straight t
  :hook
  (window-setup-hook . doom-modeline-mode)
  :custom
  (doom-modeline-minor-modes . nil)
  (doom-modeline-major-mode-icon . t)
  (doom-modeline-bar-width . 6)
  (doom-modeline-height . 15)
  (doom-modeline-modal-icon . nil)
  (doom-modeline-icon . t)
  :defer-config
  (custom-set-faces
   '(mode-line ((t (:family "Hack" :height 0.9))))
   ;; '(mode-line-active ((t (:family "Hack" :height 0.9 :weight light))))
   '(mode-line-inactive ((t (:family "Hack" :height 0.9)))))

  ;; Define your custom doom-modeline
  (doom-modeline-def-modeline 'main
    '(bar matches buffer-info remote-host buffer-position parrot selection-info lsp checker)
    '(misc-info minor-modes input-method buffer-encoding major-mode process vcs " ")) ; <-- added padding here
  (doom-modeline-def-modeline 'org-src
    '(bar matches buffer-info-simple buffer-position parrot selection-info checker)
    '(misc-info minor-modes lsp input-method buffer-encoding major-mode process vcs " ")) ; <-- added padding here
  )
