emacs.org
** centaur-tabs
#+begin_src emacs-lisp
  (leaf centaur-tabs
    :straight t
    :require t
    :hook
    ;; disable on specific modes
    (dired-mode-hook . centaur-tabs-local-mode)
    (dirvish-mode-hook . centaur-tabs-local-mode)
    (backtrace-mode-hook . centaur-tabs-local-mode)
    (eshell-mode-hook . centaur-tabs-local-mode)
    :defer-config
    (centaur-tabs-mode 1)
    (centaur-tabs-group-by-projectile-project)
    :custom
    (centaur-tabs-style . "bar")
    (centaur-tabs-set-icons . t)
    (centaur-tabs-cycle-scope . 'tabs)
    :bind
    ("C-<tab>" . centaur-tabs-forward)
    ("C-<iso-lefttab>" . centaur-tabs-backward))
#+end_src
** COMMENT tabspaces
#+begin_src emacs-lisp
  (leaf tabspaces
    :straight t
    :hook (after-init . tabspaces-mode) ;; use this only if you want the minor-mode loaded at startup.
    :commands (tabspaces-switch-or-create-workspace
               tabspaces-open-or-create-project-and-workspace)
    :custom
    (tabspaces-use-filtered-buffers-as-default . t)
    (tabspaces-default-tab . "Default")
    (tabspaces-remove-to-default . t)
    (tabspaces-include-buffers . '("*scratch*")))
#+end_src
** COMMENT awesome-tab
#+begin_src emacs-lisp
  (leaf awesome-tab
    :straight t
    :require t
    :config (awesome-tab-mode t))
#+end_src
** COMMENT bufler
#+begin_src emacs-lisp
  (leaf bufler
    :straight t
    :require t
    :config
    (bufler-mode)
    (bufler-tabs-mode))
#+end_src
* Filer
** Dirvish

Diredをオーバーホールするファイラ。
良くも悪くもdiredらしさを取っ払ってranger系に作り替えるという感じ。

#+begin_src emacs-lisp
  (leaf dirvish
    :straight
    (dirvish
     :type git
     :host github
     :repo "alexluigit/dirvish")
    :custom
    ;; Go back home? Just press `bh'
    (dirvish-bookmark-entries
     .
     '
     (("h" "~/" "Home")
      ("d" "~/Downloads/" "Downloads")
      ("e" "~/.emacs.d/" "Emacs")
      ("t" "~/.local/share/Trash/files/" "TrashCan")))
    ;; (dirvish-header-line-format '(:left (path) :right (free-space)))
    (dirvish-mode-line-format ; it's ok to place string inside
     .
     '
     (:left
      (sort file-time " " file-size symlink)
      :right (omit yank index)))
    (dirvish-attributes
     .
     '(subtree-state all-the-icons collapse file-size vc-state))
    ;; (dirvish-attributes '(file-size vscode-icon)) ; Feel free to try different combination
    ;; Maybe the icons are too big to your eyes
    ;; (dirvish-all-the-icons-height 0.8)
    ;; In case you want the details at startup like `dired'
    ;; (dirvish-hide-details nil)
    :init
    ;; Place this line under :init to ensure the overriding at startup, see #22
    (dirvish-override-dired-mode)
    ;; (dirvish-peek-mode)
    ;; Dired options are respected except a few exceptions,
    ;; see *In relation to Dired* section above
    (setq dired-recursive-deletes 'always)
    (setq delete-by-moving-to-trash t)
    (setq dired-dwim-target t)
    ;; Make sure to use the long name of flags when exists
    ;; eg. use "--almost-all" instead of "-A"
    ;; Otherwise some commands won't work properly
    (setq dired-listing-switches
          "-l --almost-all --human-readable --time-style=long-iso --group-directories-first --no-group")
    ;; (evil-make-overriding-map dired-mode-map)
    :hook
    ;; show file preview in minibuffer browsing
    ;; HACK: enabling dirvish-peek-mode in :init somehow won't show preview correctly
    (emacs-startup-hook . dirvish-peek-mode)
    :bind
    (
     (:dirvish-mode-map
      ("h" . dired-up-directory)
      ;; ("j" . dired-next-line)
      ;; ("k" . dired-previous-line)
      ("l" . dired-find-file)
      ;; ("i" . wdired-change-to-wdired-mode)
      ;; ("." . dired-omit-mode)
      ("TAB" . dirvish-subtree-toggle)
      ("SPC" . dirvish-history-jump)
      ("M-n" . dirvish-history-go-forward)
      ("M-p" . dirvish-history-go-backward)
      ("M-s" . dirvish-setup-menu)
      ("M-f" . dirvish-toggle-fullscreen)
      ("*" . dirvish-mark-menu)
      ("r" . dirvish-fd-roam)
      ("b" . dirvish-bookmark-goto)
      ("f" . dirvish-file-info-menu)
      ("y" . dirvish-yank)
      ("/" . dirvish-fd)
      ("C-f" . dirvish-fd)
      ([remap dired-sort-toggle-or-edit] . dirvish-quicksort)
      ([remap dired-do-redisplay] . dirvish-ls-switches-menu)
      ([remap dired-summary] . dirvish-dispatch)
      ([remap dired-do-copy] . dirvish-yank-menu)
      ([remap mode-line-other-buffer] . dirvish-history-last))))
#+end_src
* Git/Version Management
** git-modes
#+begin_src emacs-lisp
  (leaf git-modes
    :straight t)
#+end_src
** magit (Git Frontend)
#+begin_src emacs-lisp
  (leaf magit
    :straight t
    :bind
    (:magit-status-mode-map
     ("x" . magit-delete-thing))
    :pretty-hydra
    (my-git-actions
     (:color pink :separator "=" :quit-key "q")
     ("Movement"
      (("J" diff-hl-next-hunk "next hunk")
       ("K" diff-hl-previous-hunk "previous hunk"))
      "Diff"
      (("D" diff-hl-show-hunk "diff nearest hunk")
       ("N" diff-hl-show-hunk-next "diff next hunk")
       ("P" diff-hl-show-hunk-previous "diff previous hunk"))
      "Operation"
      (("r" diff-hl-revert-hunk "revert hunk")
       ("s" diff-hl-stage-current-hunk "stage hunk")
       ("U" diff-hl-unstage-file "unstage all"))
      "Magit"
      (("<RET>" magit-status "open magit" :color blue)
       ("c" magit-commit "commit" :color blue)))))
#+end_src
** forge (Remote Repo Control with Magit)
#+begin_src emacs-lisp
(leaf
  forge
  :doc "remote repo control with magit"
  :straight t
  :after magit
  :custom
  ((bug-reference-mode . 0) (forge-add-default-bindings . nil)))
#+end_src
** magit-todos (TODO Keywords Highlighting)
#+begin_src emacs-lisp
  (leaf
    magit-todos
    :doc "manage TODO keywords with magit"
    :straight t
    :after magit
    :hook (magit-mode-hook . magit-todos-mode))
#+end_src
** diff-hl (gitgutter in Emacs)
#+begin_src emacs-lisp
  (leaf
    diff-hl
    :straight t
    :hook
    ((magit-pre-refresh-hook . diff-hl-magit-pre-refresh)
     (magit-post-refresh-hook . diff-hl-magit-post-refresh))
    :global-minor-mode global-diff-hl-mode
    :custom
    (diff-hl-show-staged-changes . nil)
    (diff-hl-ask-before-revert-hunk . t))
#+end_src
** git-timemachine
#+begin_src emacs-lisp
  (leaf git-timemachine
    :straight t
    :commands (git-timemachine git-timemachine-toggle))
#+end_src
* Projects/Sessions Management
** autorevert (バッファの再読込)

#+begin_src emacs-lisp
(leaf
  autorevert
  :doc "revert buffers when files on disk change"
  :tag "builtin"
  :custom ((auto-revert-interval . 1) (auto-revert-check-vc-info . t))
  :global-minor-mode global-auto-revert-mode)
#+end_src
** recentf (最近使用したファイルの履歴)
#+begin_src emacs-lisp
  (leaf
    recentf
    :doc "save recent file history"
    :global-minor-mode t
    :custom
    ((recentf-save-file . "~/.emacs.d/recentf")
     (recentf-max-saved-items . 2000)
     (recentf-auto-cleanup . 'never))
    (recentf-exclude
     .
     '
     ("recentf"
      "COMMIT_EDITMSG"
      "bookmarks"
      "\\.gitignore"
      "\\.\\(?:gz\\|gif\\|svg\\|png\\|jpe?g\\)$"
      ".howm-keys"
      "^/tmp/"
      "^/scp:"
      "~/.emacs.d/straight/.*"
      (lambda (file) (file-in-directory-p file package-user-dir)))))
#+end_src
** saveplace (カーソル位置の保存)
#+begin_src emacs-lisp
  (leaf saveplace
    :config
    (save-place-mode 1))
#+end_src
** projectile
#+begin_src emacs-lisp
  ;; project management
  (leaf
    projectile
    :straight t
    :bind (:projectile-mode-map ("C-c p" . projectile-command-map))
    :global-minor-mode t)
#+end_src
** perspective
*** perspective
#+begin_src emacs-lisp
  (leaf perspective
    :straight t
    :hook
    ;; (kill-emacs-hook . persp-state-save)
    :custom
    ;; (persp-state-default-file . "~/.emacs.d/persp-state-file")
    (persp-suppress-no-prefix-key-warning . t)
    :init
    (customize-set-variable 'persp-mode-prefix-key (kbd "C-c M-p")) ; HACK: kbd doesn't work on :custom
    (persp-mode))
    
#+end_src
*** persp-projectile (per-Project perspective workspace)
#+begin_src emacs-lisp
  (leaf persp-projectile
    :straight t)
#+end_src
