emacs.org
** burly
#+begin_src emacs-lisp
  ;; sessions as bookmark
  (leaf burly
    :straight
    (burly
     :type git
     :host github
     :repo "alphapapa/burly.el")
    :config
    ;; save current windows with project name
    (defun burly-perspective-init-project-persp nil
      "Save burly windows bookmark with current buffer's project name, then set persp's name to project one."
      (interactive)
      (let ((project-name (projectile-project-name projectile-project-root))
            (persp-name (persp-current-name)))

        ;; override project-name if it's "-" (saved with *scratch*)
        (when (equal project-name "-")
          (setq project-name persp-name))
        ;; rename perspective when current persp is not project's name
        (when (not (equal project-name persp-name))
          ;; kill existing project's perspective before rename
          (when (gethash project-name (perspectives-hash))
            (persp-kill project-name))
            
          (persp-rename project-name))
          ;; ;; create perspective with last perspective name
          ;; (persp-new persp-name)
          

        ;; ;; ask persp-name interactively if it's "main"
        ;; (when (and (equal persp-name persp-initial-frame-name)
        ;;            ;; NOTE: shouldn't ask when going from *dashboard* to any burly bookmark
        ;;            ;; FIXME: buffer-name doesn't work in this case
        ;;            (string-match "\*dashboard\*" (buffer-name)))
        ;;   (call-interactively 'persp-rename)
        ;;   (setq project-name persp-name)
        ;;   )
        
        ;; save as burly-bookmark, don't save "main" persp
        (unless (equal persp-name persp-initial-frame-name)
          (burly-bookmark-windows project-name))))
        
      

    ;; initalize only if in "main" persp
    (defun burly-perspective-init-if-initial-frame (&rest _ignore)
      (when (equal persp-initial-frame-name (persp-current-name))
        (burly-perspective-init-project-persp)))
        
      
    ;; (add-hook 'find-file-hooks 'burly-perspective-init-if-initial-frame)
    ;; (advice-add 'find-file-noselect :after 'burly-perspective-init-if-initial-frame)


    ;; save current windows with perspective name
    (defun burly-bookmark-perspective-windows (&rest _ignore)
      "Save burly windows bookmark with current perspective name."
      (interactive)
      ;; save non-"main" perspective
      (when (not (equal persp-initial-frame-name (persp-current-name)))
        (burly-bookmark-windows (persp-current-name)))
      ;; save "main" perspective as project one
      (when (equal persp-initial-frame-name (persp-current-name))
        (burly-perspective-init-project-persp)))
        
      

    ;; save perspective on change/save
    (add-hook 'persp-before-switch-hook 'burly-bookmark-perspective-windows)
    ;; (add-hook 'auto-save-hook 'burly-bookmark-perspective-windows)
    (add-hook 'before-save-hook 'burly-bookmark-perspective-windows)
    ;; (add-hook 'window-configuration-change-hook 'burly-bookmark-perspective-windows)
    (advice-add 'save-buffers-kill-emacs :before 'burly-bookmark-perspective-windows)

    ;; create perspective with burly
    (defun burly-perspective--windows-set-before-advice (&rest _ignore)
      "Create or Switch perspective before setting burly windows."
      (persp-switch burly-opened-bookmark-name))
      
    (advice-add #'burly--windows-set :before #'burly-perspective--windows-set-before-advice))
    
#+end_src
* Interface Enhancement/Eyecandies
** which-key
#+begin_src emacs-lisp
  (leaf
    which-key
    :doc "which-key in emacs"
    :straight t
    :defun (which-key-setup-side-window-right which-key-mode)
    :blackout which-key-mode
    :custom (which-key-idle-delay . 0.25)
    :config
    (which-key-setup-side-window-right-bottom)
    (which-key-mode t))
#+end_src
** display-line-numbers
#+begin_src emacs-lisp
(leaf
  display-line-numbers
  :bind ("<f9>" . display-line-numbers-mode)
  :hook ((prog-mode-hook text-mode-hook) . display-line-numbers-mode)
  :custom (display-line-numbers-width . 3))
#+end_src
** solaire-mode
#+begin_src emacs-lisp
  (leaf solaire-mode
    :straight t
    :global-minor-mode solaire-global-mode)
#+end_src
** hl-line
#+begin_src emacs-lisp
(leaf hl-line :global-minor-mode global-hl-line-mode)
#+end_src
** hl-block-mode
#+begin_src emacs-lisp
(leaf hl-block-mode
  :doc "blockman thing"
  :straight t
  :hook
  (prog-mode-hook . global-hl-block-mode)
  :custom
  (hl-block-delay . 0.1)
  (hl-block-bracket . nil)
  (hl-block-multi-line . nil)
  (hl-block-color-tint . "#060606"))
    
#+end_src
** hl-todo
#+begin_src emacs-lisp
(leaf
  hl-todo
  :doc "TODO keywords highlighting"
  :straight t
  :global-minor-mode global-hl-todo-mode)
#+end_src
** highlight-indent-guides
#+begin_src emacs-lisp
(leaf
  highlight-indent-guides
  :doc "indent lines"
  :straight t
  :blackout t
  :hook
  (((prog-mode-hook yaml-mode-hook) . highlight-indent-guides-mode))
  :custom
  ((highlight-indent-guides-method . 'character)
   (highlight-indent-guides-auto-enabled . t)
   (highlight-indent-guides-responsive . t)))
#+end_src
** COMMENT hl-indent-scope (in early development, not stable for now)
#+begin_src emacs-lisp
  (leaf hl-indent-scope
    :straight
    (emacs-hl-indent-scope
     :type git
     :host nil
     :repo "https://codeberg.org/ideasman42/emacs-hl-indent-scope")
    :global-minor-mode hl-indent-scope-mode)
    
#+end_src
** rainbow-delimiters
#+begin_src emacs-lisp
  (leaf
    rainbow-delimiters
    :straight t
    :hook ((prog-mode-hook org-mode-hook) . rainbow-delimiters-mode))
#+end_src
** rainbow-mode
#+begin_src emacs-lisp
  (leaf rainbow-mode
    :straight t
    :blackout t
    :hook
    (prog-mode-hook . rainbow-mode)
    (org-mode-hook . rainbow-mode))
#+end_src
** zoom
TODO: set ignore major modes like dired
#+begin_src emacs-lisp
  ;; focus window
  (leaf
    zoom
    :straight t
    :blackout t
    :global-minor-mode zoom-mode
    :custom
    (zoom-size . '(0.618 . 0.618))
    (zoom-ignored-major-modes . '(dirvish-mode)))
#+end_src
** centered-cursor-mode
#+begin_src emacs-lisp
(leaf centered-cursor-mode
  :straight t
  :blackout t
  :global-minor-mode global-centered-cursor-mode
  :custom (ccm-step-size . 2)
  :config
  ;; exclude on vterm
  (add-to-list 'ccm-ignored-commands 'vterm--self-insert))
#+end_src
* Window Management
** winner-mode
#+begin_src emacs-lisp
(leaf winner-mode
  :bind
  (("C-z" . winner-undo)
   ("C-S-z" . winner-redo))
  :global-minor-mode winner-mode)
    
#+end_src
** move-or-create-window
#+begin_src emacs-lisp
(leaf move-or-create-window
  :doc "focus.nvim in emacs"
  :config
  (defun move-or-create-window-above nil
    (interactive)
    (if (window-in-direction 'above)
        (windmove-up)
      (progn
        (split-window-below)
        (windmove-up))))

  (defun move-or-create-window-below nil
    (interactive)
    (if (window-in-direction 'below)
        (windmove-down)
      (progn
        (split-window-below)
        (windmove-down))))

  (defun move-or-create-window-left nil
    (interactive)
    (if (window-in-direction 'left)
        (windmove-left)
      (progn
        (split-window-right)
        (windmove-left))))

  (defun move-or-create-window-right nil
    (interactive)
    (if (window-in-direction 'right)
        (windmove-right)
      (progn
        (split-window-right)
        (windmove-right)))))
    
#+end_src
* Editing
** COMMENT Evil Modal Setup
Evilに統合して・合わせて設定をしているので、他の編集モードで同じパッケージを使う場合にも設定をDRYにしない。
*** evil
#+begin_src emacs-lisp
(leaf evil
  :doc "Extensible vi layer for Emacs."
  :straight t
  :require
  evil
  windmove
  :defun
  (evil-ex-nohighlight
   evil-mc-undo-all-cursors
   evil-set-leader
   evil-mode
   turn-on-evil-mode
   evil-define-command
   evil-define-key)
  :defvar (evil-want-keybinding evil-undo-system)
  :init
  (defun my/clear-marks-and-cursors ()
    (interactive)
    (evil-ex-nohighlight)
    (evil-mc-undo-all-cursors))
  :pre-setq
  ;; for evil-collection
  (evil-want-keybinding . nil)
  ;; undo system
  (evil-undo-system . 'undo-fu)
  :custom
  ;; <C-u> to scroll (replace universal-argument)
  (evil-want-C-u-scroll . t)
  ;; don't kill on visual paste
  (evil-kill-on-visual-paste . nil)
  ;; serach module
  (evil-search-module 'evil-search)
  :config
  ;; leader-key
  (evil-set-leader 'normal (kbd "<SPC>"))
  (evil-set-leader 'visual (kbd "<SPC>"))
  ;; activate evil
  (evil-mode 1)
  (turn-on-evil-mode)
  :bind
  (
   (:evil-normal-state-map
    ("C-s" . save-buffer)
    ("C-q" . 'evil-quit)
    ("C-l" . 'my/clear-marks-and-cursors)
    ("K" . 'helpful-at-point)
    ("C-j" . 'evil-open-fold)
    ("C-k" . 'evil-close-fold)
    ("C-e" . find-file)
    ("C-S-e" . find-file-other-window)
    ("<leader>n" . 'my-mc-hydra/body)
    ("<leader>g" . 'my-git-actions/body)
    ("<leader>h" . 'move-or-create-window-left)
    ("<leader>j" . 'move-or-create-window-below)
    ("<leader>k" . 'move-or-create-window-above)
    ("<leader>l" . 'move-or-create-window-right))
   (:evil-visual-state-map
    ("<leader>n" . 'my-mc-hydra/body)
    ("C-n" . 'my-mc-hydra/evil-mc-make-and-goto-next-match)
    ("C-p" . 'my-mc-hydra/evil-mc-make-and-goto-prev-match))))
      
     
#+end_src
