init.el

;; sessions as bookmark
(leaf burly
  :straight
  (burly
   :type git
   :host github
   :repo "alphapapa/burly.el")
  :config
  ;; save current windows with project name
  (defun burly-perspective-init-project-persp nil
    "Save burly windows bookmark with current buffer's project name, then set persp's name to project one."
    (interactive)
    (let ((project-name (projectile-project-name projectile-project-root))
          (persp-name (persp-current-name)))

      ;; override project-name if it's "-" (saved with *scratch*)
      (when (equal project-name "-")
        (setq project-name persp-name))
      ;; rename perspective when current persp is not project's name
      (when (not (equal project-name persp-name))
        ;; kill existing project's perspective before rename
        (when (gethash project-name (perspectives-hash))
          (persp-kill project-name)
          )
        (persp-rename project-name)
        ;; ;; create perspective with last perspective name
        ;; (persp-new persp-name)
        )

      ;; ;; ask persp-name interactively if it's "main"
      ;; (when (and (equal persp-name persp-initial-frame-name)
      ;;            ;; NOTE: shouldn't ask when going from *dashboard* to any burly bookmark
      ;;            ;; FIXME: buffer-name doesn't work in this case
      ;;            (string-match "\*dashboard\*" (buffer-name)))
      ;;   (call-interactively 'persp-rename)
      ;;   (setq project-name persp-name)
      ;;   )

      ;; save as burly-bookmark, don't save "main" persp
      (unless (equal persp-name persp-initial-frame-name)
        (burly-bookmark-windows project-name))
      )
    )

  ;; initalize only if in "main" persp
  (defun burly-perspective-init-if-initial-frame (&rest _ignore)
    (when (equal persp-initial-frame-name (persp-current-name))
      (burly-perspective-init-project-persp)
      )
    )
  ;; (add-hook 'find-file-hooks 'burly-perspective-init-if-initial-frame)
  ;; (advice-add 'find-file-noselect :after 'burly-perspective-init-if-initial-frame)


  ;; save current windows with perspective name
  (defun burly-bookmark-perspective-windows (&rest _ignore)
    "Save burly windows bookmark with current perspective name."
    (interactive)
    ;; save non-"main" perspective
    (when (not (equal persp-initial-frame-name (persp-current-name)))
      (burly-bookmark-windows (persp-current-name)))
    ;; save "main" perspective as project one
    (when (equal persp-initial-frame-name (persp-current-name))
      (burly-perspective-init-project-persp)
      )
    )

  ;; save perspective on change/save
  (add-hook 'persp-before-switch-hook 'burly-bookmark-perspective-windows)
  ;; (add-hook 'auto-save-hook 'burly-bookmark-perspective-windows)
  (add-hook 'before-save-hook 'burly-bookmark-perspective-windows)
  ;; (add-hook 'window-configuration-change-hook 'burly-bookmark-perspective-windows)
  (advice-add 'save-buffers-kill-emacs :before 'burly-bookmark-perspective-windows)

  ;; create perspective with burly
  (defun burly-perspective--windows-set-before-advice (&rest _ignore)
    "Create or Switch perspective before setting burly windows."
    (persp-switch burly-opened-bookmark-name)
    )
  (advice-add #'burly--windows-set :before #'burly-perspective--windows-set-before-advice)
  )

;; my utility keymap
(leaf kurumi-utility
  :config
  (defvar kurumi-utility-map)
  (setq kurumi-utility-map (make-sparse-keymap))
  (bind-keys :map kurumi-utility-map
             ("g d" . xref-find-definitions)
             ("g r" . xref-find-references)
             ("c a" . lsp-execute-code-action)
             ("r n" . lsp-rename)
             ("q" . flycheck-list-errors)
             ))

(leaf
  which-key
  :doc "which-key in emacs"
  :straight t
  :defun (which-key-setup-side-window-right which-key-mode)
  :blackout which-key-mode
  :custom (which-key-idle-delay . 0.25)
  :config
  (which-key-setup-side-window-right-bottom)
  (which-key-mode t))

(leaf
  display-line-numbers
  :bind ("<f9>" . display-line-numbers-mode)
  :hook ((prog-mode-hook text-mode-hook) . display-line-numbers-mode)
  :custom (display-line-numbers-width . 3))

(leaf hl-line :global-minor-mode global-hl-line-mode)

(leaf hl-block-mode
  :doc "blockman thing"
  :straight t
  :hook
  (prog-mode-hook . global-hl-block-mode)
  :custom
  (hl-block-delay . 0.1)
  (hl-block-bracket . nil)
  (hl-block-multi-line . nil)
  (hl-block-color-tint . "#060606")
  )

(leaf
  hl-todo
  :doc "TODO keywords highlighting"
  :straight t
  :global-minor-mode global-hl-todo-mode)

(leaf
  highlight-indent-guides
  :doc "indent lines"
  :straight t
  :blackout t
  :hook
  (((prog-mode-hook yaml-mode-hook) . highlight-indent-guides-mode))
  :custom
  ((highlight-indent-guides-method . 'character)
   (highlight-indent-guides-auto-enabled . t)
   (highlight-indent-guides-responsive . t)))

(leaf
  rainbow-delimiters
  :straight t
  :hook ((prog-mode-hook org-mode-hook) . rainbow-delimiters-mode))

(leaf rainbow-mode
  :straight t
  :blackout t
  :hook
  (prog-mode-hook . rainbow-mode)
  (org-mode-hook . rainbow-mode))

;; focus window
(leaf
  zoom
  :straight t
  :blackout t
  :global-minor-mode zoom-mode
  :custom (zoom-size . '(0.618 . 0.618)))

(leaf centered-cursor-mode
  :straight t
  :blackout t
  :global-minor-mode global-centered-cursor-mode
  :custom (ccm-step-size . 2)
  :config
  ;; exclude on vterm
  (add-to-list 'ccm-ignored-commands 'vterm--self-insert))

;; enhanced help
(leaf helpful
  :straight t
  :bind
  ("C-h f" . helpful-callable)
  ("C-h k" . helpful-key)
  ("C-h v" . helpful-variable))

(leaf winner-mode
  :bind
  (("C-z" . winner-undo)
   ("C-S-z" . winner-redo))
  :global-minor-mode winner-mode
  )

(leaf move-or-create-window
  :doc "focus.nvim in emacs"
  :config
  (defun move-or-create-window-above nil
    (interactive)
    (if (window-in-direction 'above)
        (windmove-up)
      (progn
        (split-window-below)
        (windmove-up))))

  (defun move-or-create-window-below nil
    (interactive)
    (if (window-in-direction 'below)
        (windmove-down)
      (progn
        (split-window-below)
        (windmove-down))))

  (defun move-or-create-window-left nil
    (interactive)
    (if (window-in-direction 'left)
        (windmove-left)
      (progn
        (split-window-right)
        (windmove-left))))

  (defun move-or-create-window-right nil
    (interactive)
    (if (window-in-direction 'right)
        (windmove-right)
      (progn
        (split-window-right)
        (windmove-right))))
  )

(leaf meow
  :straight t
  :require t
  :init
