emacs.org
*** expand-region
#+begin_src emacs-lisp
(leaf expand-region
    :straight t)
#+end_src
*** smartparens
#+begin_src emacs-lisp
(leaf
  smartparens
  :straight t
  :require smartparens-config
  :blackout t
  :global-minor-mode smartparens-global-mode)
#+end_src
*** embrace
#+begin_src emacs-lisp
(leaf embrace
  :straight t)
#+end_src
*** COMMENT hungry-delete
#+begin_src emacs-lisp
  (leaf hungry-delete
    :straight t
    :global-minor-mode (global-hungry-delete-mode)
    :custom
    (hungry-delete-join-reluctantly . t)
    (hungry-delete-except-modes '(help-mode
                                  helpful-mode
                                  minibuffer-inactive-mode
                                  calc-mode
                                  ;; avoid conflict with parinfer-rust
                                  lisp-mode
                                  emacs-lisp-mode
                                  lisp-data-mode))



    ;; surpress parinfer warning dialog
    (parinfer-rust-troublesome-modes . nil))
#+end_src
*** smart-hungry-delete
#+begin_src emacs-lisp
  (leaf smart-hungry-delete
    :straight t
    :bind
    (;; ("<deletechar>" . 'smart-hungry-delete-backward-char)
     ;; ("<backspace>" . 'smart-hungry-delete-backward-char)
     ;; ("<delete>" . 'smart-hungry-delete-backward-char)
     ;; ("C-d" . 'smart-hungry-delete-forward-char)
     ([remap backward-delete-char-untabify] . smart-hungry-delete-backward-char)
     ([remap delete-backward-char] . smart-hungry-delete-backward-char)
     ([remap delete-char] . smart-hungry-delete-forward-char))
    :init
    (smart-hungry-delete-add-default-hooks))
#+end_src
*** backward-forward
#+begin_src emacs-lisp
(leaf backward-forward
  :straight t
  :global-minor-mode t
  :custom
  (backward-forward-mark-ring-max . 100)
  :init
  ;; reference: https://emacs-china.org/t/emacs/19171/17
  (defun my/backward-forward-previous-location ()
    "A `backward-forward-previous-location' wrap for skip invalid locations."
    (interactive)
    (let ((purge (< backward-forward-mark-ring-traversal-position (1- (length backward-forward-mark-ring))))
          (recent (point-marker)))
      (backward-forward-previous-location)
      (when (and (equal recent (point-marker)) purge)
        (my/backward-forward-previous-location))))
  (defun my/backward-forward-next-location ()
    "A `backward-forward-next-location' wrap for skip invalid locations."
    (interactive)
    (let ((purge (> backward-forward-mark-ring-traversal-position 0))
          (recent (point-marker)))
      (backward-forward-next-location)
      (when (and (equal recent (point-marker)) purge)
        (my/backward-forward-next-location)))))
    
#+end_src
*** COMMENT gumshoe
#+begin_src emacs-lisp
(leaf gumshoe
  :straight (gumshoe :type git
                     :host github
                     :repo "Overdr0ne/gumshoe"
                     :branch "master")
  :global-minor-mode (global-gumshoe-persp-mode)
  :init
  ;; Enabing global-gumshoe-mode will initiate tracking
  ;; (global-gumshoe-mode)
  ;; customize peruse slot display if you like
  ;; personally, I use perspectives, so I use the provided extension
  ;; (global-gumshoe-persp-mode)
  (setf gumshoe-slot-schema '(perspective time buffer position line))
  :custom
  (gumshoe-idle-time . 3)
  (gumshoe-log-len . 50)
  (gumshoe-follow-distance . 100)
  (gumshoe-cursor-flash-p . nil))
    
#+end_src
*** COMMENT dogears
#+begin_src emacs-lisp
(leaf dogears
  :straight t
  :global-minor-mode dogears-mode)
#+end_src
*** COMMENT better-jumper
#+begin_src emacs-lisp
(leaf better-jumper
  :straight t
  :global-minor-mode t
  :custom
  (better-jumper-context . 'window)
  :config
  ;; this is the key here. This advice makes it so you only set a jump point
  ;; if you move more than one line with whatever command you call. For example
  ;; if you add this advice around evil-next-line, you will set a jump point
  ;; if you do 10 j, but not if you just hit j. I did not write this code, I
  ;; I found it a while back and updated it to work with better-jumper.
  (defun my-jump-advice (oldfun &rest args)
    (let ((old-pos (point)))
      (apply oldfun args)
      (when (> (abs (- (line-number-at-pos old-pos) (line-number-at-pos (point))))
               1)
        (better-jumper-set-jump old-pos)))))

  ;; jump scenarios
  ;; (advice-add 'meow-search :around #'my-jump-advice)
  ;; (advice-add 'meow-visit :around #'my-jump-advice)
  ;; (advice-add 'consult--jump :around #'my-jump-advice)
  ;; (advice-add 'ccm-scroll-up :around #'my-jump-advice)
  ;; (advice-add 'ccm-scroll-down :around #'my-jump-advice)
  ;; (advice-add 'evil-goto-definition :around #'my-jump-advice)
  ;; (advice-add 'evil-goto-mark  :around #'my-jump-advice)
    
#+end_src
*** COMMENT dot-mode

キーマクロを使う仕組み上、companyなどと組み合わせて使えないため没。興味深さはあるのでその内改造するかも。

#+begin_src emacs-lisp
(leaf dot-mode
  :straight t
  :require t
  :global-minor-mode global-dot-mode
  :bind
  ;; unmap default keys
  (:dot-mode-map
   ("C-." . nil)
   ("C-M-." . nil)
   ("C-c ." . nil)))
    
#+end_src
** Utilities
*** undo-fu (with undo-fu-session)

今風なundo/redo。ファイル個別の履歴はundo-fu-sessionで実現する。

#+begin_src emacs-lisp
  ;; undo
  (leaf undo-fu
    :straight t
    :bind
    ([remap undo] . undo-fu-only-undo)
    ([remap redo] . undo-fu-only-redo))

  (leaf
    undo-fu-session
    :straight t
    :global-minor-mode global-undo-fu-session-mode)
#+end_src
*** COMMENT super-save
#+begin_src emacs-lisp
  (leaf super-save
    :straight t
    :blackout t
    :global-minor-mode super-save-mode)
#+end_src
*** origami
#+begin_src emacs-lisp
  ;; Code folding
  (leaf
    origami
    :straight t
    ;; :after evil
    :global-minor-mode global-origami-mode)
#+end_src
*** COMMENT sidekick
#+begin_src emacs-lisp
  (leaf sidekick
    :straight (sidekick
               :type git
               :host github
               :repo "VernonGrant/sidekick.el")
    :require t ;; sidekick-evil
    :bind)
  ;; (:evil-normal-state-map
  ;;  ("<leader>sn" . 'sidekick-at-point))
#+end_src
*** avy
#+begin_src emacs-lisp
  (leaf avy
    :straight t
    :custom
    (avy-timeout-seconds . 0.3)
    (avy-orders-alist .
                      '((avy-goto-char-0 . avy-order-closest)
                        (avy-goto-word-0 . avy-order-closest))))
#+end_src
*** dumb-jump
#+begin_src emacs-lisp
  (leaf dumb-jump
    :straight t
    :config
    (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
    (setq xref-show-definitions-function #'xref-show-definitions-completing-read))
#+end_src
** Text Completion
*** COMMENT corfu (with corfu-doc, cape)
**** corfu
#+begin_src emacs-lisp
  (leaf
    corfu
    :after evil
    :straight t
    :init
    (defun corfu-enable-in-minibuffer nil
      "Enable Corfu in the minibuffer if `completion-at-point' is bound."
      (when
          (where-is-internal
           #'completion-at-point
           (list (current-local-map)))
        (corfu-mode 1)))
    :hook
    ;; (minibuffer-setup-hook . corfu-enable-in-minibuffer)
    (after-init-hook . global-corfu-mode)
    :custom
    (corfu-cycle . t) ;; Enable cycling for `corfu-next/previous'
    (corfu-auto . t) ;; Enable auto completion
    (corfu-auto-delay . 0.1) ;; Enable auto completion
    (corfu-count . 15) ;; show more candidates
    ;; (corfu-quit-no-match . nil) ;; nil: マッチしないとき"no match"を表示してquitしない
    (corfu-auto-prefix . 1)
    (corfu-preview-current . t) ;; current candidate preview
    (corfu-preselect-first . t) ;; candidate preselection
    (corfu-quit-no-match . 'separator)
    (corfu-separator . ?\s)
    :bind
    (
     (:corfu-map
      ("TAB" . corfu-next)
      ("<tab>" . corfu-next)
      ("S-TAB" . corfu-previous)
      ("<backtab>" . corfu-previous)
      ("C-n" . corfu-next)
      ("C-p" . corfu-previous))
     (:yas-keymap
      ("<tab>" . nil)
      ("TAB" . nil)
      ("<backtab>" . nil)
      ("S-TAB" . nil)
      ("C-l" . yas-next-field-or-maybe-expand))
     :config
     (evil-make-overriding-map corfu-map)
     (advice-add 'corfu--setup :after 'evil-normalize-keymaps)
     (advice-add 'corfu--teardown :after 'evil-normalize-keymaps)))

  ;; show-doc
  (leaf corfu-doc
    :straight t
    :require t
    :hook (corfu-mode-hook . corfu-doc-mode))
#+end_src
**** cape
#+begin_src emacs-lisp
  (leaf
    cape
    :straight t
    :init
    (defun my/add-default-capfs ()
      "add completion backends to capfs, used as basic backends preset"
      (add-to-list 'completion-at-point-functions
                   (cape-super-capf
                    #'cape-file
                    #'cape-tex
                    #'cape-symbol
                    #'cape-keyword
                    #'cape-dabbrev
                    #'cape-abbrev)))
                    ;; #'cape-ispell
                    ;; #'cape-dict
                    ;; #'cape-line
                    

    (defun my/convert-super-capf (arg-capf)
      (list (cape-capf-buster
             (cape-super-capf arg-capf
                              (cape-company-to-capf #'company-yasnippet)
                              (cape-company-to-capf #'company-same-mode-buffers)))
                              ;; (cape-company-to-capf #'company-wordfreq)
                              
            #'cape-file
            #'cape-dabbrev
            #'cape-ispell))

    (defun my/set-basic-capf ()
      "set cape backend using completion-at-point-function list"
      (setq-local completion-at-point-functions (my/convert-super-capf (car completion-at-point-functions))))

    (defun my/set-lsp-capf ()
      "set cape backend using completion-at-point-function + lsp-completion"
      (setq-local completion-at-point-functions (my/convert-super-capf #'lsp-completion-at-point)))

    :hook
    (text-mode-hook . my/set-basic-capf)
    (prog-mode-hook . my/set-basic-capf)
    (lsp-completion-mode-hook . my/set-lsp-capf)
    (magit-mode-hook . my/set-basic-capf)
    :config
    (my/add-default-capfs))
    

  ;; to use company-backends
  (leaf company
    :straight t
    :require t
    :after cape)
    
#+end_src
*** company-mode
**** company
#+begin_src emacs-lisp
  (leaf company
    :straight t
    :bind
    (([remap indent-for-tab-command] . company-indent-or-complete-common)
     ([remap c-indent-line-or-region] . company-indent-or-complete-common)
     (:company-active-map
      ("C-w" . nil)))

    :global-minor-mode global-company-mode
    :custom
    (
     (company-idle-delay . 0.1)
     (company-minimum-prefix-length . 2)
     (company-selection-wrap-around . t)
     (company-tooltip-align-annotations . t)
     (company-dabbrev-other-buffers . 'all)
     (company-dabbrev-ignore-case . nil)
     (company-dabbrev-downcase . nil)
     (company-dabbrev-code-everywhere . t)     ;;  include comments and strings.
     (company-require-match . 'never)
     (company-transformers . '(delete-consecutive-dups company-sort-by-backend-importance))
     (company-auto-complete . nil))
    :config
    (add-to-list 'company-frontends 'company-pseudo-tooltip-frontend t)
    ;; (add-to-list 'company-frontends 'company-echo-metadata-frontend t)
    (setq company-backends '(
                             ;; get lsp completion first when available
                             (company-capf
                              :with
                              company-keywords
                              company-yasnippet
                              ;; company-dabbrev
                              company-dabbrev-code
                              company-same-mode-buffers
                              company-semantic
                              company-gtags
                              company-etags
                              ;; company-wordfreq
                              company-oddmuse
                              company-bbdb)

                             (company-keywords
                              company-yasnippet
                              ;; company-dabbrev
                              company-dabbrev-code
                              company-same-mode-buffers
                              company-semantic
                              company-gtags
                              company-etags
                              ;; company-wordfreq
                              company-oddmuse
                              company-bbdb)

                             company-files
                             company-dabbrev
                             company-same-mode-buffers
                             company-wordfreq
                             company-bbdb
                             company-oddmuse))

    ;; magit commit message completion with magit-diff
    (defun my--company-dabbrev-ignore-except-magit-diff (buffer)
      (let ((name (buffer-name)))
        (and (string-match-p "\\`[ *]" name)
             (not (string-match-p "\\*magit-diff:" name)))))

    (defun my--git-commit-setup-hook ()
      (setq-local fill-column 72)

      (setq-local company-dabbrev-code-modes '(text-mode magit-diff-mode))
      (setq-local company-dabbrev-ignore-buffers
                  #'my--company-dabbrev-ignore-except-magit-diff))

    (add-hook 'git-commit-setup-hook #'my--git-commit-setup-hook))
#+end_src
**** company-box
#+begin_src emacs-lisp
  (leaf company-box
    :straight t
    :require t
    :after company
    :hook (company-mode-hook . company-box-mode))
    
#+end_src
