init.el

(leaf expand-region
    :straight t)

(leaf
  smartparens
  :straight t
  :require smartparens-config
  :blackout t
  :global-minor-mode smartparens-global-mode)

(leaf embrace
  :straight t)

(leaf smart-hungry-delete
  :straight t
  :bind
  (("<deletechar>" . 'smart-hungry-delete-backward-char)
   ("<delete>" . 'smart-hungry-delete-backward-char)
   ("C-d" . 'smart-hungry-delete-forward-char)
   ([remap backward-delete-char-untabify] . smart-hungry-delete-backward-char)
   ([remap delete-backward-char] . smart-hungry-delete-backward-char)
   ([remap delete-char] . smart-hungry-delete-forward-char))
  :init
  (smart-hungry-delete-add-default-hooks))

(leaf backward-forward
  :straight t
  :global-minor-mode t
  :custom
  (backward-forward-mark-ring-max . 100)
  :init
  ;; reference: https://emacs-china.org/t/emacs/19171/17
  (defun my/backward-forward-previous-location ()
    "A `backward-forward-previous-location' wrap for skip invalid locations."
    (interactive)
    (let ((purge (< backward-forward-mark-ring-traversal-position (1- (length backward-forward-mark-ring))))
          (recent (point-marker)))
      (backward-forward-previous-location)
      (when (and (equal recent (point-marker)) purge)
        (my/backward-forward-previous-location))))
  (defun my/backward-forward-next-location ()
    "A `backward-forward-next-location' wrap for skip invalid locations."
    (interactive)
    (let ((purge (> backward-forward-mark-ring-traversal-position 0))
          (recent (point-marker)))
      (backward-forward-next-location)
      (when (and (equal recent (point-marker)) purge)
        (my/backward-forward-next-location))))
  )

;; undo
(leaf undo-fu
  :straight t
  :bind
  ([remap undo] . undo-fu-only-undo)
  ([remap redo] . undo-fu-only-redo)
  )
(leaf
  undo-fu-session
  :straight t
  :global-minor-mode global-undo-fu-session-mode)

;; Code folding
(leaf
  origami
  :straight t
  ;; :after evil
  :global-minor-mode global-origami-mode)

(leaf avy
  :straight t
  :custom
  (avy-timeout-seconds . 0.3)
  (avy-orders-alist .
    '((avy-goto-char-0 . avy-order-closest)
      (avy-goto-word-0 . avy-order-closest)))
  )

(leaf dumb-jump
  :straight t
  :config
  (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
  (setq xref-show-definitions-function #'xref-show-definitions-completing-read))
