emacs.org
**** company-dwim
#+begin_src emacs-lisp
  (leaf company-dwim
    :straight (company-dwim :type git :host github :repo "zk-phi/company-dwim")
    :require t
    :after company
    :bind (:company-active-map
           ("TAB" . company-dwim)
           ("<tab>" . company-dwim)
           ("S-TAB" . company-dwim-select-previous)
           ("<backtab>" . company-dwim-select-previous)
           ("C-j" . company-complete-selection))
    :config
    (add-to-list 'company-frontends 'company-dwim-frontend t))
#+end_src
**** company-anywhere
#+begin_src emacs-lisp
  (leaf company-anywhere
    :straight (company-anywhere :type git :host github :repo "zk-phi/company-anywhere")
    :require t)
#+end_src
*** company-same-mode-buffers (backend)
#+begin_src emacs-lisp
  (leaf company-same-mode-buffers
    :straight (company-same-mode-buffers :type git :host github :repo "zk-phi/company-same-mode-buffers")
    :require t
    :after company
    :custom
    (company-same-mode-buffers-matchers .
                                        '(
                                          company-same-mode-buffers-matcher-flex
                                          company-same-mode-buffers-matcher-partial
                                          company-same-mode-buffers-matcher-exact-first-letter-flex-rest))
                                          
    :config
    (company-same-mode-buffers-initialize))
    
#+end_src
*** company-wordfreq (backend)
#+begin_src emacs-lisp
  (leaf company-wordfreq
    :straight t
    :require t
    :after company
    :init
    (setq company-wordfreq-path
          (no-littering-expand-var-file-name "wordfreq-dicts/")))
#+end_src
*** fussy (fuzzy completion-styles)
#+begin_src emacs-lisp
  ;; completion style
  (leaf
    fussy
    :straight t
    :require t
    :init
    (leaf
      fuz-bin
      :straight
      '
      (fuz-bin
       :repo "jcs-elpa/fuz-bin"
       :fetcher github
       :files (:defaults "bin"))
      :require t
      :defun (fuz-bin-load-dyn)
      :config (fuz-bin-load-dyn))
    :custom
    ((completion-styles . '(fussy))
     (completion-category-defaults . nil)
     (compleiton-category-overrides . nil)
     (fussy-filter-fn . 'fussy-filter-default)
     (fussy-score-fn . 'fussy-fuz-bin-score)
     (fussy-fuz-use-skim-p . t))
    :config
    ;; integrate with company
    (defun j-company-capf (f &rest args)
      "Manage `completion-styles'."
      (let ((fussy-max-candidate-limit 5000)
            (fussy-default-regex-fn 'fussy-pattern-first-letter)
            (fussy-prefer-prefix nil))
        (apply f args)))

    (defun j-company-transformers (f &rest args)
      "Manage `company-transformers'."
      (let ((company-transformers '(fussy-company-sort-by-completion-score)))
        (apply f args)))

    (advice-add 'company--transform-candidates :around 'j-company-transformers)
    (advice-add 'company-capf :around 'j-company-capf))
    
#+end_src
*** yasnippet
**** yasnippet
#+begin_src emacs-lisp
  (leaf
    yasnippet
    :straight t
    :require t
    :blackout t
    :global-minor-mode yas-global-mode)
#+end_src
**** yasnippet-snippets
#+begin_src emacs-lisp
  (leaf yasnippet-snippets
    :straight t
    :require t
    :after yasnippet)
#+end_src
** Translation
*** COMMENT define-it
#+begin_src emacs-lisp
(leaf define-it
  :straight t
  :commands (define-it define-it-at-point)
  :custom
  (google-translate-backend-method . 'curl)
  ;; Auto detect language.
  (google-translate-default-source-language . "auto")
  ;; Set your target language.
  (google-translate-default-target-language ."ja")
  :init)
  ;; workaround serach tkk error
  ;; (defun google-translate--search-tkk () "Search TKK." (list 430675 2721866130))
    
#+end_src
*** go-translate
#+begin_src emacs-lisp
(leaf go-translate
  :straight t
  :require t
  :config
  (setq gts-translate-list '(("en" "ja") ("ja" "en")))
  (setq gts-default-translator
        (gts-translator
         :picker (gts-prompt-picker)
         :engines (list
                   (gts-bing-engine)
                   (gts-google-engine)
                   (gts-deepl-engine :auth-key (getenv "DEEPL_TOKEN") :pro nil))
         :render (gts-buffer-render))))
    
#+end_src
** COMMENT Hyperbole
#+begin_src emacs-lisp
  (leaf hyperbole
    :straight t
    :hook
    ;; (window-setup-hook . hyperbole-mode)
    (org-mode-hook . hyperbole-mode)
    (prog-mode-hook . hyperbole-mode)
    (conf-mode-hook . hyperbole-mode)
    (yaml-mode-hook . hyperbole-mode))
    
#+end_src

* Syntax Check/Formatting
** flycheck

非同期で文法などのチェックを行う。

#+begin_src emacs-lisp
  ;; flycheck syntax checking
  (leaf
    flycheck
    :straight t
    :require t
    :global-minor-mode global-flycheck-mode
    :init
    (leaf flycheck-inline
      :straight t
      :hook (flycheck-mode-hook . flycheck-inline-mode))
    :custom
    (flycheck-display-errors-delay . 0.1)
    :config
    ;; tweak fringe icons
    (define-fringe-bitmap 'flycheck-fringe-bitmap-ball
      (vector #b00000000
              #b00000000
              #b00000000
              #b00000000
              #b00000000
              #b00111000
              #b01111100
              #b11111110
              #b11111110
              #b01111100
              #b00111000
              #b00000000
              #b00000000
              #b00000000
              #b00000000
              #b00000000
              #b00000000))

    (flycheck-define-error-level 'error
      :severity 2
      :overlay-category 'flycheck-error-overlay
      :fringe-bitmap 'flycheck-fringe-bitmap-ball
      :fringe-face 'flycheck-fringe-error)

    (flycheck-define-error-level 'warning
      :severity 1
      :overlay-category 'flycheck-warning-overlay
      :fringe-bitmap 'flycheck-fringe-bitmap-ball
      :fringe-face 'flycheck-fringe-warning)
      

    (flycheck-define-error-level 'info
      :severity 0
      :overlay-category 'flycheck-info-overlay
      :fringe-bitmap 'flycheck-fringe-bitmap-ball
      :fringe-face 'flycheck-fringe-info))
      
    
#+end_src
** flyspell (with flyspell-correct)
*** flyspell
aspellなどのスペルチェッカーを利用したspellcorect的なやつ。
#+begin_src emacs-lisp
  (leaf flyspell
    :blackout (flyspell-mode flyspell-prog-mode)
    :hook
    (text-mode-hook . flyspell-mode)
    (prog-mode-hook . flyspell-prog-mode)
    (conf-mode-hook . flyspell-prog-mode)
    (yaml-mode-hook . flyspell-prog-mode)
    :defvar
    (ispell-extra-args
     ispell-aspell-dict-dir
     ispell-aspell-data-dir
     ispell-program-name)
    :defun (ispell-get-aspell-config-value)
    :config
    (pcase
        (cond
         ((executable-find "aspell")
          'aspell)
         ((executable-find "hunspell")
          'hunspell)
         ((executable-find "enchant-2")
          'enchant))
      (`aspell
       (setq
        ispell-program-name
        "aspell"
        ispell-extra-args '("--sug-mode=ultra" "--run-together"))

       (unless ispell-aspell-dict-dir
         (setq ispell-aspell-dict-dir
               (ispell-get-aspell-config-value "dict-dir")))
       (unless ispell-aspell-data-dir
         (setq ispell-aspell-data-dir
               (ispell-get-aspell-config-value "data-dir"))))
      (`hunspell (setq ispell-program-name "hunspell"))
      (`enchant (setq ispell-program-name "enchant-2"))
      (_ (system-packages-ensure "aspell"))))
#+end_src
*** flyspell-lazy
#+begin_src emacs-lisp
  (leaf flyspell-lazy
    :straight
    (flyspell-lazy
     :type git
     :host github
     :repo "rolandwalker/flyspell-lazy")
    :after flyspell
    :custom
    (flyspell-lazy-idle-seconds . 1)
    (flyspell-lazy-window-idle-seconds . 3)
    :config
    (flyspell-lazy-mode))
    
#+end_src
*** flyspell-correct
#+begin_src emacs-lisp
  (leaf
    flyspell-correct
    :straight t
    :after flyspell

    :bind (([remap ispell-word] . flyspell-correct-at-point)))
           ;; (:evil-normal-state-map
           ;;  ("zg" . flyspell-correct-at-point)
           ;;  )
           
#+end_src
** eldoc
#+begin_src emacs-lisp
(leaf
  eldoc
  :doc "hovered element documentation"
  :hook (emacs-lisp-mode-hook . turn-on-eldoc-mode)
  :blackout t
  :preface
  (defun my:shutup-eldoc-message (f &optional string)
    (unless (active-minibuffer-window) (funcall f string)))
  :advice (:around eldoc-message my:shutup-eldoc-message))
#+end_src

