init.el

;; flycheck syntax checking
(leaf
  flycheck
  :straight t
  :require t
  :global-minor-mode global-flycheck-mode
  :init
  (leaf flycheck-inline
    :straight t
    :hook (flycheck-mode-hook . flycheck-inline-mode))
  :custom
  (flycheck-display-errors-delay . 0.1)
  :config
  ;; tweak fringe icons
  (define-fringe-bitmap 'flycheck-fringe-bitmap-ball
    (vector #b00000000
            #b00000000
            #b00000000
            #b00000000
            #b00000000
            #b00111000
            #b01111100
            #b11111110
            #b11111110
            #b01111100
            #b00111000
            #b00000000
            #b00000000
            #b00000000
            #b00000000
            #b00000000
            #b00000000))

  (flycheck-define-error-level 'error
    :severity 2
    :overlay-category 'flycheck-error-overlay
    :fringe-bitmap 'flycheck-fringe-bitmap-ball
    :fringe-face 'flycheck-fringe-error)

  (flycheck-define-error-level 'warning
    :severity 1
    :overlay-category 'flycheck-warning-overlay
    :fringe-bitmap 'flycheck-fringe-bitmap-ball
    :fringe-face 'flycheck-fringe-warning
    )

  (flycheck-define-error-level 'info
    :severity 0
    :overlay-category 'flycheck-info-overlay
    :fringe-bitmap 'flycheck-fringe-bitmap-ball
    :fringe-face 'flycheck-fringe-info
    )
  )

(leaf flyspell
  :blackout (flyspell-mode flyspell-prog-mode)
  :hook
  (text-mode-hook . flyspell-mode)
  (prog-mode-hook . flyspell-prog-mode)
  (conf-mode-hook . flyspell-prog-mode)
  (yaml-mode-hook . flyspell-prog-mode)
  :defvar
  (ispell-extra-args
   ispell-aspell-dict-dir
   ispell-aspell-data-dir
   ispell-program-name)
  :defun (ispell-get-aspell-config-value)
  :config
  (pcase
      (cond
       ((executable-find "aspell")
        'aspell)
       ((executable-find "hunspell")
        'hunspell)
       ((executable-find "enchant-2")
        'enchant))
    (`aspell
     (setq
      ispell-program-name
      "aspell"
      ispell-extra-args '("--sug-mode=ultra" "--run-together"))

     (unless ispell-aspell-dict-dir
       (setq ispell-aspell-dict-dir
             (ispell-get-aspell-config-value "dict-dir")))
     (unless ispell-aspell-data-dir
       (setq ispell-aspell-data-dir
             (ispell-get-aspell-config-value "data-dir"))))
    (`hunspell (setq ispell-program-name "hunspell"))
    (`enchant (setq ispell-program-name "enchant-2"))
    (_ (system-packages-ensure "aspell"))))

(leaf flyspell-lazy
  :straight
  (flyspell-lazy
  :type git
  :host github
  :repo "rolandwalker/flyspell-lazy")
  :after flyspell
  :custom
  (flyspell-lazy-idle-seconds . 1)
  (flyspell-lazy-window-idle-seconds . 3)
  :config
  (flyspell-lazy-mode)
  )

(leaf
  flyspell-correct
  :straight t
  :after flyspell

  :bind (([remap ispell-word] . flyspell-correct-at-point)
         ;; (:evil-normal-state-map
         ;;  ("zg" . flyspell-correct-at-point)
         ;;  )
         ))

(leaf
  eldoc
  :doc "hovered element documentation"
  :hook (emacs-lisp-mode-hook . turn-on-eldoc-mode)
  :blackout t
  :preface
  (defun my:shutup-eldoc-message (f &optional string)
    (unless (active-minibuffer-window) (funcall f string)))
  :advice (:around eldoc-message my:shutup-eldoc-message))
