emacs.org
** vertico
#+begin_src emacs-lisp
  (leaf
    vertico
    :straight t
    :global-minor-mode vertico-mode
    :custom ((vertico-cycle . t))
    :config
    ;; Use `consult-completion-in-region' if Vertico is enabled.
    ;; Otherwise use the default `completion--in-region' function.
    (setq completion-in-region-function
          (lambda (&rest args)
            (apply (if vertico-mode
                       #'consult-completion-in-region
                     #'completion--in-region)
                   args))))
    
#+end_src
** consult (Narrowing Functions)
*** consult
#+begin_src emacs-lisp
  (leaf consult
    :straight t
    :defvar (consult-buffer-sources)
    :setq
    (
     (completion-in-region-function
      .
      (lambda (&rest args)
        (apply
         (if vertico-mode
             #'consult-completion-in-region
           #'completion--in-region)
         args)))
     (consult-buffer-sources
      .
      '
      (
       consult-projectile--source-projectile-buffer
       persp-consult-source
       consult--source-bookmark
       consult-projectile--source-projectile-project
       consult-projectile--source-projectile-recentf
       consult--source-buffer
       consult--source-hidden-buffer
       consult--source-recent-file)))
       
    :config
    ;; don't set sources on top
    (consult-customize consult--source-buffer persp-consult-source :default nil)
    ;; hide outer-perspecitve sources
    (consult-customize consult--source-buffer consult--source-recent-file :hidden t)
    ;; preview delay
    (consult-customize
     consult-ripgrep consult-git-grep consult-grep
     consult-bookmark consult-recent-file consult-xref
     consult--source-bookmark consult--source-recent-file
     consult--source-project-recent-file
     :preview-key '(:debounce 0.3 any))
    :bind)
    ;; ((:evil-normal-state-map
    ;;   ;; ("C-f" . consult-line)
    ;;   ("C-f" . (lambda () (interactive)(if (switch-to-minibuffer) nil (consult-line))))
    ;;   ("<leader>SPC" . 'consult-buffer)
    ;;   ))
    
#+end_src
*** consult-flycheck
#+begin_src emacs-lisp
  ;; flycheck integration
  (leaf consult-flycheck
    :straight t
    :after consult flycheck
    :bind
    ())
     ;; (:evil-normal-state-map
     ;;       ("<leader>q" . (lambda () (interactive)(if (switch-to-minibuffer) nil (consult-flycheck))))
     ;;       )
     
#+end_src
*** consult-dir
#+begin_src emacs-lisp
  ;; dir extension
  (leaf
    consult-dir
    :straight t
    :after consult
    :bind
    (("C-x C-d" . consult-dir)
     (:vertico-map
      ("C-x C-d" . consult-dir)
      ("C-x C-j" . consult-dir-jump-file)))
     ;; (:evil-normal-state-map
     ;;  ("C-S-r" . consult-dir)
     ;;  )
     
    :custom
    (consult-dir-project-list-function . #'consult-dir-projectile-dirs))
#+end_src
*** consult-projectile
projectile integration
#+begin_src emacs-lisp
  (leaf consult-projectile
    :straight (consult-projectile
               :type git
               :host gitlab
               :repo "OlMon/consult-projectile")
               
    :require t
    :custom
    ;; (consult-projectile-use-projectile-switch-project . t)
    (consult-projectile-source-projectile-project-action . 'kurumi-consult-projectile--project-persp-action) ;; hook my custom action
    :config
    ;; create persp and cd before consult-projectile
    (defun kurumi-consult-projectile--project-persp-action (dir)
      (persp-switch (projectile-project-name dir))
      (cd (projectile-project-root dir))
      (consult-projectile--file dir)))
      
    
#+end_src
*** consult-flyspell
#+begin_src emacs-lisp
  (leaf consult-flyspell
    :straight (consult-flyspell :type git :host gitlab :repo "OlMon/consult-flyspell" :branch "master")
    :after (consult flyspell)
    :config
    (setq consult-flyspell-select-function 'flyspell-correct-at-point
          consult-flyspell-set-point-after-word t
          consult-flyspell-always-check-buffer t))
    
#+end_src
** embark
#+begin_src emacs-lisp
  ;;; embark
  (leaf embark
    :straight t
    :doc "minibuffer actions"
    :bind
    (("C-." . embark-act)         ;; pick some comfortable binding
     ("M-." . embark-dwim)        ;; good alternative: M-.
     ("C-h B" . embark-bindings))) ;; alternative for `describe-bindings'
    

  ;; consult integration
  (leaf embark-consult
    :straight t
    :after (embark consult))
#+end_src
** marginalia (Show Command Description)
#+begin_src emacs-lisp
  ;; marginalia
  (leaf
    marginalia
    :straight t
    :defvar (marginalia-mode)
    :global-minor-mode marginalia-mode)
#+end_src
** COMMENT minibuffer-header
#+begin_src emacs-lisp
  (leaf minibuffer-header
    :straight t
    :global-minor-mode minibuffer-header-mode)
#+end_src
** affe
#+begin_src emacs-lisp
  ;; affe fuzzy-finder
  (leaf
    affe
    :straight t
    :commands (affe-grep affe-find)
    :init
    (leaf orderless :straight t :commands (orderless-pattern-compiler))
    (defun affe-orderless-regexp-compiler (input _type _ignorecase)
      (setq input (orderless-pattern-compiler input))
      (cons input (lambda (str) (orderless--highlight input str))))
    (setq affe-regexp-compiler #'affe-orderless-regexp-compiler))
#+end_src
** savehist
#+begin_src emacs-lisp
(leaf
  savehist
  :straight t
  :defvar (savehist-coding-system)
  :init (savehist-mode)
  :setq (savehist-coding-system . 'utf-8-emacs))
#+end_src
** switch-to-minibuffer
#+begin_src emacs-lisp
(leaf switch-to-minibuffer
  :init
  (defun switch-to-minibuffer ()
    "Switch to minibuffer window."
    (interactive)
    (if (active-minibuffer-window)
        (select-window (active-minibuffer-window))
      nil)))
    
#+end_src
* Treesitter Configs
*** treesitter
#+begin_src emacs-lisp
(leaf tree-sitter
  :straight t
  :global-minor-mode global-tree-sitter-mode
  :hook
  (treesitter-after-on-hook . tree-sitter-hl-mode))
#+end_src
*** treesitter-langs
#+begin_src emacs-lisp
(leaf tree-sitter-langs
  :straight t
  :after tree-sitter)
#+end_src
* Terminal/Shell Command
** Terminal
*** vterm
#+begin_src emacs-lisp
  (leaf vterm
    :straight t
    :ensure-system-package cmake libtool (libtool . libtool-bin)
    :init
    (leaf vterm-toggle
      :straight t)
    :bind
    (
     ;; ("C-@" . vterm-toggle)
     (:vterm-mode-map
      ("<C-w>" . (lambda () (interactive) (vterm-send-key (kbd "C-w"))))))

    :custom
    (vterm-max-scrollback . 10000))
#+end_src
*** eshell
**** eshell
#+begin_src emacs-lisp
(leaf eshell
  :require t
  :custom
  (eshell-cmpl-ignore-case . t)
  (eshell-hist-ignoredups . t)
  (eshell-scroll-to-bottom-on-input . 'all)
  (eshell-scroll-to-bottom-on-output . 'all)
  (eshell-kill-processes-on-exit . t)
  :defer-config
  ;; HACK: can't map directly to eshell-mode-map
  (add-hook 'eshell-mode-hook
            (lambda ()
              (progn
                ;; avoid overriding c-n/c-p for meow compatibility
                (define-key eshell-mode-map "\C-k" 'eshell-previous-matching-input-from-input)
                (define-key eshell-mode-map "\C-j" 'eshell-next-matching-input-from-input)))))
    
#+end_src
**** eshell-toggle
#+begin_src emacs-lisp
(leaf eshell-toggle
  :straight t
  :require t
  :custom
  (eshell-toggle-size-fraction . 3)
  (eshell-toggle-use-projectile-root . nil)
  (eshell-toggle-run-command . nil)
  (eshell-toggle-init-function . #'eshell-toggle-init-eshell)
  ;; (eshell-toggle-init-function . #'eshell-toggle-init-ansi-term)
  :bind
  ("C-@" . eshell-toggle))
#+end_src
**** eshell-up
#+begin_src emacs-lisp
(leaf eshell-up
  :straight t
  :require t)
    
#+end_src
**** eshell-z
#+begin_src emacs-lisp
  (leaf eshell-z
    :straight t
    :after eshell
    :require t)
#+end_src
**** esh-autosuggest
fish-like history suggestion
#+begin_src emacs-lisp
(leaf esh-autosuggest
  :straight t
  :hook (eshell-mode-hook . esh-autosuggest-mode))
    
#+end_src
